xml-parsing/core/src/test/resources/req_escaped_embedded_small.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header/>
	<SOAP-ENV:Body>
		<ns3:A xmlns:ns3="urn:myNamespace">
			<B>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot; standalone=&quot;yes&quot;?&gt;
&lt;Message xmlns=&quot;http://www.myOther.org&quot;&gt;
	&lt;MyHeader&gt;
		&lt;C&gt;test-mail@dummy.org&lt;/C&gt;
	&lt;/MyHeader&gt;
	&lt;MyContent&gt;
		&lt;D&gt;NachrichtBetreff&lt;/D&gt;
		&lt;E&gt;
			&lt;F&gt;9002&lt;/F&gt;
		&lt;/E&gt;
		&lt;Breakpoint&gt;
			&lt;Encoding&gt;
				&lt;F&gt;9004&lt;/F&gt;
				&lt;Type&gt;text/plain&lt;/Type&gt;
			&lt;/Encoding&gt;
			&lt;Text&gt;NachrichtText&lt;/Text&gt;
		&lt;/Breakpoint&gt;
		&lt;MyContainer&gt;
			&lt;Data&gt;TG9yZW0gaXBzdW0gZG9sb3Igc2l0IGFtZXQsIGNvbnNldGV0dXIgc2FkaXBzY2luZyBlbGl0ciwgc2VkIGRpYW0gbm9udW15IGVpcm1vZCB0ZW1wb3IgaW52aWR1bnQgdXQgbGFib3JlIGV0IGRvbG9yZSBtYWduYSBhbGlxdXlhbSBlcmF0LCBzZWQgZGlhbSB2b2x1cHR1YS4gQXQgdmVybyBlb3MgZXQgYWNjdXNhbSBldCBqdXN0byBkdW8&lt;/Data&gt;
			&lt;FileName&gt;myFileName&lt;/FileName&gt;
			&lt;FileType&gt;
				&lt;F&gt;95&lt;/F&gt;
				&lt;Type&gt;txt&lt;/Type&gt;
			&lt;/FileType&gt;
		&lt;/MyContainer&gt;
		&lt;MyContainer&gt;
			&lt;Data&gt;TG9yZW0gaXBzdW0gZG9sb3Igc2l0IGFtZXQsIGNvbnNldGV0dXIgc2FkaXBzY2luZyBlbGl0ciwgc2VkIGRpYW0gbm9udW15IGVpcm1vZCB0ZW1wb3IgaW52aWR1bnQgdXQgbGFib3JlIGV0IGRvbG9yZSBtYWduYSBhbGlxdXlhbSBlcmF0LCBzZWQgZGlhbSB2b2x1cHR1YS4gQXQgdmVybyBlb3MgZXQgYWNjdXNhbSBldCBqdXN0byBkdW8&lt;/Data&gt;
			&lt;FileName&gt;FileName2&lt;/FileName&gt;
			&lt;FileType&gt;
				&lt;F&gt;95&lt;/F&gt;
				&lt;Type&gt;txt&lt;/Type&gt;
			&lt;/FileType&gt;
		&lt;/MyContainer&gt;		
	&lt;/MyContent&gt;
&lt;/Message&gt;</B>
			<Z>
				<W>
					<F>9004</F>
					<Boing>text/plain</Boing>
				</W>
				<G>NachrichtText</G>
			</Z>
		</ns3:A>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
